[
    {
        "file":"\/mnt\/data\/TO_THE_THEORY_OF_DECAYING_TURBULENCE (4).pdf",
        "section":1,
        "text":"Citation:\nMigdal, A. A. Title.\nPreprints\n2023\n,\n1\n, 0.\n https:\/\/doi.org\/\nAcademic Editor(s): Ivanka Stamova,\nGani Stamov\nCopyright:\n©\n2025 by the author.\nSubmitted to\nPreprints\nfor possible open\naccess publication under the terms and\nconditions of the Creative Commons\nAttri- bution (CC BY) license (\nhttps:\/\/\ncreativecommons.org\/licenses\/by\/\n4.0\/).\nArticle\nTO THE THEORY OF DECAYING TURBULENCE\nAlexander Migdal\n1, ƒ , ⁄\n1\nDepartment of Physics, New York University Abu Dhabi,Saadiyat Island, Abu Dhabi, PO Box 129188, Abu\nDhabi, United Arab Emirates; am10485@nyu.edu\nAbstract:\nWe have found an in\u0002nite dimensional manifold of exact solutions of the Navier-Stokes\nloop equation for the Wilson loop in decaying Turbulence in arbitrary dimension\nd\n>\n2\n. This solution\nfamily is equivalent to a fractal curve in complex space\nC\nd\nwith random steps parametrized by\nN\nIsing\nvariables\ns\ni\n=\n\u0006\n1\n, in addition to a rational number\np\nq\nand an integer winding number\nr\n, related by\nå\ns\ni\n=\nq r\n. This equivalence provides a dual theory describing a strong turbulent phase of the Navier-\nStokes \u0003ow in\nR\nd\nspace as a random geometry in a different space, like ADS\/CFT correspondence\nin gauge theory. From a mathematical point of view, this theory implements a stochastic solution\nof the unforced Navier-Stokes equations. For a theoretical physicist, this is a quantum statistical\nsystem with integer-valued parameters, satisfying some number theory constraints. Its long-range\ninteraction leads to critical phenomena when its size\nN\n!\n¥\nor its chemical potential\nm\n!\n0\n. The\nsystem with \u0002xed\nN\nhas different asymptotics at odd and even\nN\n!\n¥\n, but the limit\nm\n!\n0\nis well\nde\u0002ned. The energy dissipation rate is analytically calculated as a function of\nm\nusing methods of\nnumber theory. It grows as\nn\n\/\nm\n2\nin the continuum limit\nm\n!\n0, leading to anomalous dissipation at\nm\nµ\np\nn\n!\n0\n. The same method is used to compute all the local vorticity distribution, which has no\ncontinuum limit but is renormalizable "
    },
    {
        "file":"\/mnt\/data\/TO_THE_THEORY_OF_DECAYING_TURBULENCE (4).pdf",
        "section":2,
        "text":"in the sense that in\u0002nities can be absorbed into the rede\u0002nition\nof the parameters. The small perturbation of the \u0002xed manifold satis\u0002es the linear equation we solved\nin a general form. This perturbation decays as\nt\n\nl\n, with a continuous spectrum of indexes\nl\nin the\nlocal limit\nm\n!\n0\n. The spectrum is determined by a resolvent, which is represented as an in\u0002nite\nproduct of 3\n\n\n3 matrices depending of the element of the Euler ensemble.\nKeywords:\nTurbulence, fractal, anomalous dissipation, \u0002xed point, decay Spectrum, velocity circula-\ntion, loop equations, Euler Phi, prime numbers\n1. Introduction\nWe derived a functional equation for the so-called loop average or Wilson loop in\nturbulence a while ago. All the references to our previous works can be found in a recent\nreview paper [\n1\n].\nThe path to an exact solution by a dimensional reduction in this equation was proposed\nin the 1993 paper but has just been explored. At the time, we could not compare a theory\nwith anything but crude measurements in physical and numerical experiments at modest\nReynolds numbers. All these experiments agreed with the K41 scaling, so the exotic\nequation based on unjusti\u0002ed methods of quantum \u0002eld theory was premature. The\nspeci\u0002c prediction of the Loop equation, namely the Area law, could not be veri\u0002ed in DNS\nat the time with existing computer power.\n1.1. Fluctuating geometry in gauge theory and turbulent \u0003ow\nThe situation has changed over the last decades. No alternative microscopic theory\nbased on the Navier-Stokes equation emerged, but our und erstanding of the strong turbu-\nlence phenomena grew signi\u0002cantly. On the other hand, the loop equations technology in\nthe gauge theory also advanced over the last decades. The correspondence between the\nloop space functionals and the original vector \u0002elds was better understood, and various so-\nlutions to the gauge loop equations were found. In particular, the momentum loop equation\nwas developed, similar to our momentum loop used below [\n2\n,\n3\n]"
    },
    {
        "file":"\/mnt\/data\/TO_THE_THEORY_OF_DECAYING_TURBULENCE (4).pdf",
        "section":3,
        "text":". Recently, some numerical\nmethods were found to solve loop equations beyond perturbation theory [\n4\n,\n5\n]. The loop\n\n2 of 42\ndynamics was extended to quantum gravity, where it was used to study nonperturbative\nphenomena [\n6\n,\n7\n].\nAll these old and new developments made loop equations a major nonperturbative\napproach to gauge \u0002eld theory. So, it is time to revive the hibernating theory of the loop\nequations in turbulence, where these equations are much simpler. The latest DNS [\n8\nŒ\n11\n]\nwith Reynolds numbers of tens of thousands revealed and quanti\u0002ed violations of the K41\nscaling laws. These numerical experiments are in agreement with so-called multifractal\nscaling laws [\n12\n].\nTheoretically, we studied the loop equation in the con\u0002nement region (large circulation\nover large loop\nC\n) and justi\u0002ed the Area law suggested in '93 on heuristic arguments. This\nlaw says that the tails of velocity circulation PDF in the con\u0002nement region are functions of\nthe minimal area inside this loop. It"
    },
    {
        "file":"\/mnt\/data\/Microscopic_Theory_of_Decaying_Turbulence_Revised2 (2).pdf",
        "section":1,
        "text":"Quantum Solution of Classical Turbulence.\nDecaying Energy Sp ectrum\nAlexander Migdal\nDepartment of Physics, New York University Abu Dhab i,\nSaadiyat Island, Abu Dhabi,\nPO Box 12918 8, Abu Dhabi, United Arab Emirates\na)\n(*Electronic mail:\n sasha.migdal@gmail.com\n)\n(Dated: February 3, 2025)\nThis pap er presents a recent advancement that transforms the problem of decaying turbulence in the Navier-\nStokes equations in 3 + 1 dimensions into a Numb er Theory challenge: \fnding the statistical limit of the\nEuler ensemble. We rede\fne this ensemble as a Markov chain, establishing its equivalence to the quantum\nstatistical theory of\nN\nFermions on a ring, interacting with an external \feld asso ciated with random fractions\nof\nˇ\n. Analyzing this theory in the turbulent limit, where\nN\n! 1\nand\n\u0017\n!\n0, we discover the solution as\na complex tra jectory (instanton) that acts as a saddle p oint in the path integral over the density of these\nFermions.\nBy computing the contribution of this instanton to the vorticity correlation function, we obtain an analytic\nformula for the observable energy sp ectrum|a complete solution of decaying turbulence derived entirely from\n\frst principles without the need for approximations or \ftted dimensionless parameters. Our analysis reveals\nthe full sp ectrum of critical indices in the velo city correlation function in co ordinate space, determined by\nthe p oles of the Mellin transform, which we prove to b e a meromorphic function. Real and complex p oles\nare identi\fed, with the complex p oles re\recting dissipation and uniquely determined by the famous complex\nzeros of the Riemann zeta function.\nUniversal functions of the scaling variables sup ersede the traditional turbulent scaling laws (K41, Heisen-\nb erg, and multifractal). These functions for the energy sp ectrum, energy decay rate, and velo city correlation\nsigni\fcantly deviate from p ower laws but closely match the results from grid turbulence exp eriments\n9\n,\n10\nand\nrecent DNS data\n49\nwithin exp eri"
    },
    {
        "file":"\/mnt\/data\/Microscopic_Theory_of_Decaying_Turbulence_Revised2 (2).pdf",
        "section":2,
        "text":"mental error margins.\nKeywords: Turbulence, Fractal, Fixed Point, Velo city Circulation, Lo op Equations, Euler Phi, Prime Num-\nb ers, Path Integral, Instanton, Markov Chain, Energy decay\nI. PROLOGUE\nTurbulence app ears as an overwhelmingly complex\nphenomenon. As depicted in Fig.\n1\n from a recent\nsimulation\n51\n, vortex lines of various shap es and sizes are\nentangled much like spaghetti. This visual complexity\nraises the question: How can such complexity b e de-\nscrib ed analytically? Yet, it also sparks hop e for a sim-\npli\fed statistical description.\nWith its myriad interacting particles, molecular dy-\nnamics similarly presents an intricate challenge. How-\never, despite its complexity, a straightforward statisti-\ncal description emerges that grows increasingly precise\nwith the escalating complexity of the dynamical system.\nMaxwell, Boltzmann, and Gibbs demonstrated that New-\nton's mechanics uniformly cover the energy surface over\ntime, laying the groundwork for statistical mechanics|a\nrobust theory, alb eit sometimes computationally chal-\nlenging, as in critical phenomena.\nWhy, then, should Navier-Stokes turbulence b e any\ndi\u000berent?\nRegrettably, to date, no known analog of the Gibbs\ndistribution exists for turbulent \rows. Therefore, a foun-\na)\nAlso at IAS, Pri nceton, NJ starting Septemb er 2024.\ndational element of turbulence theory must b e to devise\na substitute for the Gibbs distribution.\nHopf initiated this exploration in 1952 (see the re-\ncent review in\n48\n), formulating a functional equation that\nthe probability distribution of the turbulent velo city \feld\nmust satisfy. Through iterative application of this equa-\ntion to the nonlinear term in the Navier-Stokes equation,\none can generate an expansion in inverse p owers of vis-\ncosity. The core challenge of turbulence theory is solving\nthe Hopf equation in the opp osite limit of low viscosity.\nThis b eautiful equation is mathematically as intricate\nas the vortex spaghetti depicted earlier. Such complex-\nity p"
    },
    {
        "file":"\/mnt\/data\/Microscopic_Theory_of_Decaying_Turbulence_Revised2 (2).pdf",
        "section":3,
        "text":"laces turbulence high within the hierarchy of physics\ntheories, nestled b etween critical phenomena and the\nquark con\fnement problem.\nOur theory, initiated in 1993 (see Fig.\n2\n for the his-\ntorical outline), prop oses a simpler variant of the Hopf\nequation|the lo op equation|which su\u000eces to de\fne the\nstatistics.\nThe lo op equation corresp onds to the Scodinger\nequation in lo op space. This profound analogy is not a\np o etic metaphor but a precise mathematical equivalence\nwith signi\fcant implications, such as quantum interfer-\nence e\u000bects a\u000becting the scaling laws of classical turbu-\nlence.\nUsing the lo op equation, we have identi\fed a new in-\n\n2\nFigure 1. The three-dimensional vortices in quantum turbu-\nlent \row from \"Polanco, J.I., Muller, N.P. & Krstulovic, G.\nVortex clustering, p olarisation and circulation intermittency\nin classical and quantum turbulence\". Nat Commun 12, 7090\n(2021). Licensed under a Creative Commons Attribution (CC\nBY) license.\nFigure 2. The path to the microscop"
    },
    {
        "file":"\/mnt\/data\/Mathematical_Solution_of_Decaying_Turbulence (1).pdf",
        "section":1,
        "text":"royal so ciety publishing.org\/journal\/rspa\nResearch\nArticle submitted to journal\nSubject Areas:\nFluid Dynamics, Turbulence,\nStatistics\nKeywords:\nTurbulence, Fractal, Fixed Point,\nVelo city Circulation, Lo op\nEquations, Quantum Mechanics,\nString Theory, Numb er Theory\nAuthor for corresp ondence:\nAlexander Migdal\ne-mail: amigdal@ias.edu\nDuality of Decaying\nTurbule nc e to a\nSolvable String Theory\nAlexander Migdal\nInstitute for Advanced Study, Pr inceton, NJ, USA\nWe prop ose a novel analytical framework for\nincompressible Navier-Stokes (NS) turbulence,\nrevealing a duality b etween classical ˛uid dynamics\nand one-dimensional nonlinear dynamics in lo op\nspace. This reformulation leads to a universal\nmomentum lo op eq uation, which excludes ˝nite-time\nblow-ups, establishing a\nNo Explosion Theorem\nfor\nturbulent ˛ows with ˝nite initial noise.\nDecaying turbulence emerges as a solution to this\nequation and is interpreted as a solvable string\ntheory with a discrete target space comp osed of\nregular star p olygons. The derived decay sp ectrum\nexhibits excellent agreem ent with exp erimental data\nand direct numerical simulations (DNS), replacing\nclassical Kolmogorov scaling laws with universal\nfunctions derived from numb er theory.\nThese results suggest a deep er mathematical\nstructure underlying turbulence, uniting ˛uid\ndynamics, quantum mechanics, and numb er theory.\n©\nThe Authors. Published by the Royal So ciety under\nthe terms of the C reative Co mmons Attribution License\nhttp:\/\/creativecommo ns.org\/licenses\/\nby\/ 4.0\/, which p ermits unrestricted use, provided the original\nauthor and source are credited.\n\n2\nroyalso cietypublishing.org\/journal\/rspa Pro c R So c A 0000000\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n1. Intro duction\nTurbulence remains one of the most challenging problems in classical physics. Its inherently\nchaotic and multiscale dynamics have de˝ed complete theoretical understa"
    },
    {
        "file":"\/mnt\/data\/Mathematical_Solution_of_Decaying_Turbulence (1).pdf",
        "section":2,
        "text":"nding for centuries,\ndespite signi˝cant advances since the foundational contributions of Newton, Euler, and Stokes.\nAmong its many forms, decayingharacterized by the dissipation of energy from\nan initial high-energy b een particularly resistant to exact analytical treatm ent, even\nas exp erimental and computational techniques have advanced. While extensively studied, a\nmathematically rigorous framework for describing its dynamics has remained elusive.\n(a) The Challenge of Decaying Turbulence\nDecaying turbulence evolves in a purely dissipative regime, raising fundamental questions ab out\nits underlying principles: How can randomness arise in a deterministic system governed by the\nNavier-Stokes (NS) equations? What governs the decay of turbulent kinetic energy, and can this\npro cess b e describ ed by universal laws?\nTraditional approaches to turbulence, including Kolmogorov's\nK\n41\nmo del, Heisenb erg's\nk\n\n7\nenergy sp ectrum for the deep dissipative range, and multifractal mo dels, provide scaling laws\nderived from heuristic arguments and empirical observations. However, these scaling laws are\nnot rigorously derived from the NS equations; moreover, they fail to capture the dynamics of\ndecaying turbulence, as highlighted in recent studies [\n1\n]. On the theoretical side, Hopf 's 1952\nstatistical framework intro duced a functional equation for the probability distribution of velo city\n˝elds, but this remains unsolved in the low-viscosity limit relevant to turbulence.\n(b) The Euler Ensemble and a New Paradigm\nThis work advances a novel framework for three-dim ensional turbulence, based on the Navier-\nStokes lo op equation [\n2\n] and its exact analytical solution [\n3\n,\n4\n], term ed the\nEuler ensemble\n. The\nEuler ensemble maps turbulent dynamics onto a discrete set of states, represented by regular\nstar p olygons with rational vertex angles\n2\nˇ p=q\n, where\np\nand\nq\nare coprim e integers.\nA surprising duality emerges from this framework: the dynamics of classical turbulence in\n"
    },
    {
        "file":"\/mnt\/data\/Mathematical_Solution_of_Decaying_Turbulence (1).pdf",
        "section":3,
        "text":"three space dimensions corresp ond to a hidden one-dimensional quantum system, akin to the\nAdS\/CFT corresp ondence in quantum ˝eld theory. Within this duality, the strong turbulence\nregime corresp onds to the quasiclassical limit of the Euler ensemble, rendering the system\nanalytically solvable.\nThe central ob ject in this framework is the lo op functional,\n\t\n[\nC ; t\n]\n, de˝ned as the\ncharacteristic function for the distribution of velo city circulation around a static lo op\nC\n. In the\ndual formulation,\n\t\n[\nC ; t\n]\nserves as the wave function in lo op space and satis˝es a lo op equation\nequivalent to a Schrö dinger eq uation with a complex Hamiltonian. Functional derivatives of\n\t\n[\nC ; t\n]\nyield equal-time correlation functions of the vorticity ˝eld,\n~!\n=\n~\nr \u0002\n~v\n. Our exact solution\nfor\n\t\n[\nC ; t\n]\n, describing decaying turbulence, enables the com putation of vorticity correlation\nfunctions in quadrature using functions from numb er theory.\nThis solution replaces traditional heuristi"
    }
]